//
//  GameData.swift
//  Millionaire
//
//  Created by Евгений Дегтярев on 27.10.2021.
//

import Foundation

struct Question {
    
    var question: [Int:String] = [
        1:"Согласно известной песни, трус в эту игру не играет",
        2:"Какое название носит знаменитое произведение А.С. Грибоедова?",
        3:"В каком году был основан город, известный как Окно в Европу?"
    ]
    
    var response: [Int:[String]] = [
        1:["хоккей","дартс","бейсбол","боулинг"],
        2:["Буря до утра","Горе от ума","Поле без краев","Море ты мое"],
        3:["1699","1704","1703","1765"]
    
    ]
    
    var trueAnswer: [Int:Int] = [
        1:1,
        2:2,
        3:3
    ]
    
}
